CREATE DATABASE  IF NOT EXISTS `coin_operated_ktv` /*!40100 DEFAULT CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci */ /*!80016 DEFAULT ENCRYPTION='N' */;
USE `coin_operated_ktv`;
-- MySQL dump 10.13  Distrib 8.0.41, for Win64 (x86_64)
--
-- Host: localhost    Database: coin_operated_ktv
-- ------------------------------------------------------
-- Server version	8.0.41

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `order_detail`
--

DROP TABLE IF EXISTS `order_detail`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `order_detail` (
  `id` int NOT NULL AUTO_INCREMENT COMMENT '流水號',
  `order_id` int DEFAULT NULL COMMENT 'order.id',
  `product_id` int DEFAULT NULL COMMENT 'product.id',
  `product_name` varchar(45) DEFAULT NULL,
  `price` int DEFAULT NULL COMMENT '價格',
  `qty` int DEFAULT NULL COMMENT '數量',
  `created_at` timestamp NOT NULL DEFAULT (now()),
  `is_deleted` tinyint(1) NOT NULL DEFAULT '0',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=86 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci COMMENT='訂單明細';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `order_detail`
--

LOCK TABLES `order_detail` WRITE;
/*!40000 ALTER TABLE `order_detail` DISABLE KEYS */;
INSERT INTO `order_detail` VALUES (1,1,1,'一般單曲',10,1,'2025-02-20 06:57:50',0),(2,2,2,'新歌單曲',15,1,'2025-02-20 06:57:50',0),(3,3,1,'一般單曲',10,1,'2025-02-21 07:56:41',0),(4,4,1,'新歌單曲',15,1,'2025-02-21 07:57:24',0),(5,5,1,'一般單曲',10,1,'2025-02-22 14:54:46',0),(6,6,1,'一般單曲',10,1,'2025-02-22 14:56:06',0),(7,7,1,'一般單曲',10,1,'2025-02-22 14:59:17',0),(8,8,1,'一般單曲',10,1,'2025-02-22 14:59:29',0),(9,9,1,'一般單曲',10,1,'2025-02-22 15:03:36',0),(10,10,1,'一般單曲',10,1,'2025-02-22 15:03:42',0),(11,11,1,'一般單曲',10,1,'2025-02-22 15:13:35',0),(12,12,1,'一般單曲',10,1,'2025-02-22 15:13:56',0),(13,13,1,'一般單曲',10,1,'2025-02-22 15:14:49',0),(14,14,1,'一般單曲',10,1,'2025-02-22 15:15:04',0),(15,15,1,'一般單曲',10,1,'2025-02-22 15:23:42',0),(16,16,1,'一般單曲',10,1,'2025-02-22 15:24:00',0),(17,17,1,'一般單曲',10,1,'2025-02-22 15:24:28',0),(18,18,1,'一般單曲',10,1,'2025-02-22 15:24:33',0),(19,19,1,'一般單曲',10,1,'2025-02-22 15:24:50',0),(20,20,2,'新歌單曲',15,1,'2025-02-22 15:25:25',0),(21,21,1,'一般單曲',10,1,'2025-02-22 15:30:53',0),(22,22,1,'一般單曲',10,1,'2025-02-22 15:31:55',0),(23,23,1,'一般單曲',10,1,'2025-02-22 15:32:46',0),(24,24,1,'一般單曲',10,1,'2025-02-22 15:33:05',0),(25,25,1,'一般單曲',10,1,'2025-02-22 15:33:12',0),(26,26,1,'一般單曲',10,1,'2025-02-22 15:34:19',0),(27,27,1,'一般單曲',10,1,'2025-02-22 15:35:50',0),(28,28,1,'一般單曲',10,1,'2025-02-22 15:39:34',0),(29,29,1,'一般單曲',10,1,'2025-02-22 15:41:01',0),(30,30,1,'一般單曲',10,1,'2025-02-22 15:41:35',0),(31,31,1,'一般單曲',10,1,'2025-02-22 15:42:02',0),(32,32,1,'一般單曲',10,1,'2025-02-22 15:44:32',0),(33,33,1,'一般單曲',10,1,'2025-02-22 15:44:43',0),(34,34,1,'一般單曲',10,1,'2025-02-22 15:45:34',0),(35,35,1,'一般單曲',10,1,'2025-02-22 15:45:38',0),(36,36,1,'一般單曲',10,1,'2025-02-22 15:45:42',0),(37,37,1,'一般單曲',10,1,'2025-02-22 15:45:48',0),(38,38,1,'一般單曲',10,1,'2025-02-22 15:45:53',0),(39,39,1,'一般單曲',10,1,'2025-02-22 15:50:06',0),(40,40,1,'一般單曲',10,1,'2025-02-22 15:50:09',0),(41,41,1,'一般單曲',10,1,'2025-02-22 15:50:12',0),(42,42,1,'一般單曲',10,1,'2025-02-22 15:50:16',0),(43,43,1,'一般單曲',10,1,'2025-02-22 15:52:30',0),(44,44,1,'一般單曲',10,1,'2025-02-22 15:54:03',0),(45,45,1,'一般單曲',10,1,'2025-02-22 15:55:54',0),(46,46,1,'一般單曲',10,1,'2025-02-22 15:55:58',0),(47,47,1,'一般單曲',10,1,'2025-02-22 15:56:04',0),(48,48,1,'一般單曲',10,1,'2025-02-22 16:48:36',0),(49,49,1,'一般單曲',10,1,'2025-02-22 16:48:40',0),(50,50,2,'新歌單曲',15,1,'2025-02-22 17:12:54',0),(51,51,2,'新歌單曲',15,1,'2025-02-22 17:13:05',0),(52,52,2,'新歌單曲',15,1,'2025-02-22 17:16:08',0),(53,53,2,'新歌單曲',15,1,'2025-02-22 17:20:52',0),(54,54,2,'新歌單曲',15,1,'2025-02-22 17:24:14',0),(55,55,2,'新歌單曲',15,1,'2025-02-22 17:40:46',0),(56,56,2,'新歌單曲',15,1,'2025-02-22 17:55:11',0),(57,57,2,'新歌單曲',15,1,'2025-02-22 17:59:17',0),(58,58,2,'新歌單曲',15,1,'2025-02-22 17:59:43',0),(59,59,2,'新歌單曲',15,1,'2025-02-22 18:02:50',0),(60,60,2,'新歌單曲',15,1,'2025-02-22 18:03:09',0),(61,61,1,'一般單曲',10,1,'2025-02-22 18:03:46',0),(62,62,2,'新歌單曲',15,1,'2025-02-22 18:13:01',0),(63,63,2,'新歌單曲',15,1,'2025-02-22 18:13:25',0),(64,64,1,'一般單曲',10,1,'2025-02-24 06:37:14',0),(65,65,1,'一般單曲',10,1,'2025-02-24 06:37:17',0),(66,66,1,'一般單曲',10,1,'2025-02-24 06:44:14',0),(67,67,2,'新歌單曲',15,1,'2025-02-24 06:46:06',0),(68,68,2,'新歌單曲',15,1,'2025-02-24 06:46:10',0),(69,69,1,'一般單曲',10,1,'2025-02-24 06:47:21',0),(70,70,1,'一般單曲',10,1,'2025-02-24 06:47:25',0),(71,71,2,'新歌單曲',15,1,'2025-02-24 06:47:28',0),(72,72,2,'新歌單曲',15,1,'2025-02-24 06:47:31',0),(73,73,2,'新歌單曲',15,1,'2025-02-24 06:48:03',0),(74,74,2,'新歌單曲',15,1,'2025-02-24 07:02:37',0),(75,75,1,'一般單曲',10,1,'2025-02-24 07:03:50',0),(76,76,2,'新歌單曲',15,1,'2025-02-24 07:03:56',0),(77,77,2,'新歌單曲',15,1,'2025-02-24 07:04:11',0),(78,78,1,'一般單曲',10,1,'2025-02-24 07:47:32',0),(79,79,1,'一般單曲',10,1,'2025-02-24 09:03:58',0),(80,80,1,'一般單曲',10,1,'2025-02-24 09:04:02',0),(81,81,1,'一般單曲',10,1,'2025-02-24 09:04:05',0),(82,82,1,'一般單曲',10,1,'2025-02-24 09:04:17',0),(83,83,2,'新歌單曲',15,1,'2025-02-24 09:05:23',0),(84,84,1,'一般單曲',10,1,'2025-02-25 02:46:58',0),(85,85,2,'新歌單曲',15,1,'2025-02-25 02:47:21',0);
/*!40000 ALTER TABLE `order_detail` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2025-02-25 16:28:22
